tests/Mock/ExtendedFetchSubscriptionsSuccess.txt

HTTP/1.1 200 OK
Date: Thu, 13 Apr 2017 18:11:22 GMT
Server: Apache
Set-Cookie: JSESSIONID=1234567890ABCDEF1234567890ABCDEF; Path=/services/; Secure; HttpOnly
Transfer-Encoding: chunked
Content-Type: application/xml
Vary: Accept-Encoding
Strict-Transport-Security: max-age=31536000 ; includeSubDomains

<?xml version="1.0" encoding="UTF-8"?>
<shopper-subscriptions xmlns="http://ws.plimus.com">
  <ordering-shopper>
    <shopper-id>[CUSTOMER_REFERENCE_1]</shopper-id>
  </ordering-shopper>
  <subscriptions>
    <subscription>
      <subscription-id>[SUBSCRIPTION_REFERENCE_1]</subscription-id>
      <status>[STATUS_1]</status>
      <underlying-sku-id>[PLAN_REFERENCE_1]</underlying-sku-id>
      <shopper-id>[CUSTOMER_REFERENCE_1]</shopper-id>
      <credit-card>
        <card-last-four-digits>1111</card-last-four-digits>
        <card-type>Visa</card-type>
        <card-sub-type>CREDIT</card-sub-type>
        <card-category>CLASSIC</card-category>
      </credit-card>
      <catalog-recurring-charge>
        <currency>[CURRENCY_1]</currency>
        <amount>[AMOUNT_1]</amount>
      </catalog-recurring-charge>
      <charge-frequency>MONTHLY</charge-frequency>
      <next-charge-date>30-Sep-17</next-charge-date>
      <auto-renew>true</auto-renew>
      <last-charge-result>
        <result-code>SUCCESS</result-code>
      </last-charge-result>
      <subscription-charges />
    </subscription>
    <subscription>
      <subscription-id>[SUBSCRIPTION_REFERENCE_2]</subscription-id>
      <status>[STATUS_2]</status>
      <underlying-sku-id>[PLAN_REFERENCE_2]</underlying-sku-id>
      <shopper-id>[CUSTOMER_REFERENCE_2]</shopper-id>
      <credit-card>
        <card-last-four-digits>1111</card-last-four-digits>
        <card-type>Visa</card-type>
        <card-sub-type>CREDIT</card-sub-type>
        <card-category>CLASSIC</card-category>
      </credit-card>
      <catalog-recurring-charge>
        <currency>[CURRENCY_2]</currency>
        <amount>[AMOUNT_2]</amount>
      </catalog-recurring-charge>
      <charge-frequency>ONDEMAND</charge-frequency>
      <auto-renew>true</auto-renew>
      <last-charge-result>
        <result-code>SUCCESS</result-code>
      </last-charge-result>
      <subscription-charges>
        <subscription-charge>
          <charge-info />
          <charge-invoice-info>
            <date-created>11-Nov-15</date-created>
            <invoice-id>38442304</invoice-id>
            <invoice-amount>5.00</invoice-amount>
            <invoice-currency>USD</invoice-currency>
          </charge-invoice-info>
        </subscription-charge>
        <subscription-charge>
          <charge-info>
            <charge-description>some text</charge-description>
          </charge-info>
          <charge-invoice-info>
            <date-created>11-Nov-15</date-created>
            <invoice-id>38442336</invoice-id>
            <invoice-amount>1.00</invoice-amount>
            <invoice-currency>USD</invoice-currency>
          </charge-invoice-info>
        </subscription-charge>
        <subscription-charge>
          <charge-info>
            <charge-description>some text</charge-description>
          </charge-info>
          <charge-invoice-info>
            <date-created>11-Nov-15</date-created>
            <invoice-id>38442334</invoice-id>
            <invoice-amount>1.00</invoice-amount>
            <invoice-currency>USD</invoice-currency>
          </charge-invoice-info>
        </subscription-charge>
      </subscription-charges>
    </subscription>
  </subscriptions>
</shopper-subscriptions>
